snlkuharlocal/src/Documents/ЛистМаркировки/ЛистМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистМаркировки</name>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОклейкаНеВыполнялась</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНаборы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковокРаспечатанная</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПечати</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ЛистМаркировки/ManagerModule.bsl
Функция НайтиСоздатьЛистМаркировки (ДокОснование,ЛистНабора=Неопределено) экспорт
	// Кухарь А.Ю.  04.07.2024 начало
	возврат СоздатьЛистМаркировки(ДокОснование,ЛистНабора);	
	// Кухарь А.Ю.  04.07.2024 конец
	
	
	если ЛистНабора=Неопределено тогда
		ЛистНабора=документы.ЛистНабора.ПустаяСсылка();
	КонецЕсли;
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	             |	ЛистМаркировки.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ЛистМаркировки КАК ЛистМаркировки
	             |ГДЕ
	             |	ЛистМаркировки.ДокОснование = &ДокОснование
	             |	И ЛистМаркировки.Проведен
	             |	И ЛистМаркировки.ЛистНабора = &ЛистНабора";
	запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	запрос.УстановитьПараметр("ЛистНабора",ЛистНабора);
	выборка=запрос.Выполнить().Выбрать();
	если выборка.Количество()=0 тогда
		 возврат СоздатьЛистМаркировки(ДокОснование,ЛистНабора);
	 КонецЕсли;
	 
	пока выборка.Следующий() цикл
		возврат выборка.ссылка;
	КонецЦикла;
	
КонецФункции

Функция СоздатьЛистМаркировки (ДокОснование,ЛистНабора)
	
	ЛистМаркировки=Документы.ЛистМаркировки.СоздатьДокумент();
	
	
	ЛистМаркировки.ДокОснование=ДокОснование;
	ЛистМаркировки.ОбработкаЗаполнения(ДокОснование,"",Истина);
	ЛистМаркировки.ЛистНабора=ЛистНабора;
	ЛистМаркировки.Дата=ТекущаяДатаСеанса();	 
	ЛистМаркировки.Подразделение=ПараметрыСеанса.ЭтотУзел.Подразделение;
	ЛистМаркировки.Записать(РежимЗаписиДокумента.Проведение); 
	РеквизитыДокОснования=ПолучитьРеквизитыШапки(ДокОснование,"ДокОснование.Организация","Документ");
	ЛистМаркировки.Организация=РеквизитыДокОснования.ДокОснование_Организация;
	
	Возврат ЛистМаркировки.Ссылка;
КонецФункции


//Тут будут особые ЛМ, 
//которые либо с фиктивным нанесением кодов (реально не наносим, но списываем), например комплектующие спаек
//либо сами спаечные коды (возможно потом переделаю на хранение в другом месте)
Функция ДополнитьКодамиЛистМаркировки (ДокОснование,ЛистНабора,ПараметрыЗаполнения,МассивКодов) экспорт
	
	ЭтоНаборы=ложь;
	ОклейкаНеВыполнялась = ложь;
	если ТипЗнч(ПараметрыЗаполнения) = Тип("Структура") тогда
		если ПараметрыЗаполнения.свойство("ОклейкаНеВыполнялась") тогда
			ОклейкаНеВыполнялась=Истина;
		КонецЕсли;	
		если ПараметрыЗаполнения.свойство("ЭтоНаборы") тогда
			ЭтоНаборы=Истина;
		КонецЕсли;	
	КонецЕсли;	
	
	
	Запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛистМаркировки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЛистМаркировки КАК ЛистМаркировки
	|ГДЕ
	|	ЛистМаркировки.ДокОснование = &ДокОснование
	|	И ЛистМаркировки.Проведен
	|	И ЛистМаркировки.ЛистНабора = &ЛистНабора
	|	И ЛистМаркировки.ОклейкаНеВыполнялась = &ОклейкаНеВыполнялась
	|	И ЛистМаркировки.ЭтоНаборы = &ЭтоНаборы";
	запрос.УстановитьПараметр("ДокОснование",ДокОснование);
	запрос.УстановитьПараметр("ЛистНабора",ЛистНабора);
	запрос.УстановитьПараметр("ОклейкаНеВыполнялась",ОклейкаНеВыполнялась);
	запрос.УстановитьПараметр("ЭтоНаборы",ЭтоНаборы);
	
	выборка=запрос.Выполнить().Выбрать();
	ПервичнаяЗапись=ложь;
	если выборка.Количество()=0 тогда
		ЛМ = СоздатьЛистМаркировки(ДокОснование,ЛистНабора);
		ПервичнаяЗапись=Истина;
	КонецЕсли;
	пока выборка.Следующий() цикл
		ЛМ = выборка.ссылка;
	КонецЦикла;
	
	ЛМОбъект=ЛМ.получитьобъект();
	если ПервичнаяЗапись тогда
		ЛМОбъект.Дата=ТекущаяДата();
	КонецЕсли;
	
	
	для каждого КодЧЗ из МассивКодов цикл
		если ЛМОбъект.ШтрихкодыУпаковок.Найти(КодЧЗ,"ШтрихкодУпаковки")<>Неопределено тогда
			ВызватьИсключение "Обнаружены дубли кодов в листе маркировки "+КодЧЗ;
		КонецЕсли;		
		если ЛМОбъект.ШтрихкодыУпаковокРаспечатанная.Найти(КодЧЗ,"ШтрихкодУпаковки")<>Неопределено тогда
			ВызватьИсключение "Обнаружены дубли кодов в листе маркировки (список распечатанных кодов) "+КодЧЗ;
		КонецЕсли;
		
		СтрТЧ=ЛМОбъект.ШтрихкодыУпаковок.Добавить();
		СтрТЧ.ШтрихкодУпаковки=КодЧЗ;
		
		СтрТЧ=ЛМОбъект.ШтрихкодыУпаковокРаспечатанная.Добавить();
		СтрТЧ.ШтрихкодУпаковки=КодЧЗ;
		СтрТЧ.ДатаПечати=ЛМОбъект.Дата-1;		
	КонецЦикла;
	
	
	ЛМОбъект.записать(РежимЗаписиДокумента.Проведение);
	
КонецФункции
